#include <stdio.h>

int main() {
    int n; // довжина послідовностей
    scanf("%d", &n);
    int a = 1, b = 1, c = 1; // змінні для зберігання кількості послідовностей, що закінчуються на одну, дві або три одиниці
    for (int i = 1; i < n; i++) {
        int ta = a, tb = b, tc = c;
        a = (ta + tb + tc) % 12345; // кількість послідовностей, що закінчуються на одну одиницю
        b = ta % 12345; // кількість послідовностей, що закінчуються на дві одиниці
        c = tb % 12345; // кількість послідовностей, що закінчуються на три одиниці
    }
    printf("%d\n", (a + b) % 12345); // виведення суми кількостей послідовностей, що закінчуються на одну або дві одиниці
    return 0;
}
